{
    "timeline":
    {
        "headline":"My Timeline",
        "type":"default",
        "text":"People say stuff",
        "startDate":"2012,1,1",
        "date": [
            {
                "startDate":"2011,2,23",
                "endDate":"2012,2,6",
                "headline":"Royal College Curepipe",
                "text":"<h4>Cambridge A-Level Examination </h4>  ",
                "asset":
                {
                    "media":"<h4 align=\"left\" > Mathematics: A*  <br> Physics: A* <br> Computing: A <br> French: A <br> General Paper: B </h4>",
                    "credit":"",
                    "caption":""
                }
            },
            {
                "startDate":"2012,9,17",
                "endDate":"2016,6,1",
                "headline":"University of Hong Kong",
                "text":"<h4>Bachelors of Engineering </h4>  <h5> Computer Science</h5>"
            },
            {
                "startDate":"2015,9,2",
                "endDate":"2015,9,2",
                "headline":"Credit Suisse APAC Hackathon",
                "text":"<h4>Bachelors of Engineering </h4>  <h5> Computer Science</h5>"
            },
            {
                "startDate":"2014,6,26",
                "endDate":"2015,6,5",
                "headline":"HSBC",
                "text":"<p>Securities Services IT </p>  <p> Middleware Management </p> ",
                "asset":
                {
                    "media":"Responsible for generating test reports for data migration programs and running conversion tests in the user-acceptance testing environment. Developed data validation tools using Java and carried out enhancements on the internal business system. Attended training for AS400, RPG ILE and CL Programming. Published resource usage reports for project managers. Other duties included extensive administrative tasks, checking connections between databases, performing health checks and debugging batch jobs. Acquired business knowledge on securities and post-trading activities. Enhanced the middleware management system to improve and optimize tracking the usage of servers using Java with the Spring framework.",
                    "credit":"",
                    "caption":""
                }

            },
            {
                "startDate":"2015,6,8",
                "endDate":"2015,9,5",
                "headline":"Credit Suisse Internship",
                "text":"<h4>Summer Technology Analyst<h4>",
                "asset":
                {
                    "media":"<h4> Advanced Execution Services </h4> <p> Migrated an algorithmic trading simulator to a newer generation of the Credit Suisse internal order management system. Discovered and fixed original design issues found in the simulator while also implementing a Market Data. Publisher/Subscriber component to allow the simulator to publish market and quant data to the algorithmic engine. Developed a web-based UI to allow developers to load market data files and perform some trend analysis.</p> <h4> Index Management </h4> <p>Formed part of the Index Management team and developed reliable APIs to process and display information related to stock baskets. </p> ",
                    "credit":"",
                    "caption":""
                }
            }
        ]
    }
}