[
  {
    "Name": "Joachim Jake Layes",
    "About": "Jake Layes is Head of Sustainability and Clean Tech for AsiaPacific at Autodesk, a leading provider of design innovation software to architects, engineers, and designers. He is responsible for AsiaPacific Sustainability initiatives and managing the Autodesk's Clean Tech Partner Program in AsiaPacific, which supports the efforts, innovations and environmental advancements of clean technology partners across the region. Jake has been a frequent speaker at a range of prominent design and innovation conferences, including the Design Business Forum in Tokyo, Japan; the National Design Conference in New Delhi, India; the Tsinghua International Design Symposium in Beijing, China; Harvard Project for Asia and International Relations 2012 (HPAIR), Taipei, Taiwan; and the Nikkei BP International Conference for a Sustainable Future, Tokyo, Japan. A German by Nationality, Jake has a broad international background and has been in Asia since 1997, having lived & worked in Singapore and Japan and is now covering Asia Pacific out of Hong Kong. Jake holds an MBA from Hong Kong University of Science and Technology and from the Kellogg Graduate School of Management, Northwestern University, as well as a Bachelor of Science - Industrial Design from Art Center College of Design in Pasadena, USA."
  },
  {
    "Name": "Angela Li",
    "About": "Angela Li is an associate at the Hong Kong office of Davis Polk & Wardwell, one of the largest international law firm in Asia. Angela has experience in a broad range of corporate transactions including public and private mergers and acquisitions, capital market, corporate advisory and general compliances. She has worked with listed corporations on the HKSE, NYSE and ASX, State-owned Enterprises in China and other large private enterprises in the Asia-Pacific regions across a variety of industries including financial services, oil and gas, energy, retail, insurance and others. Prior to coming to Hong Kong, Angela has also worked in other leading law firms in Sydney and Tokyo. She graduated from University of Sydney with a Bachelor of Commerce and Bachelor of Law (Hons, First Class) in 2002. Angela is admitted to practice in New South Wales, Australia and is also a registered foreign lawyer in Hong Kong since 2012."
  },
  {
    "Name": "Prof. Anselmo Reyes",
    "About": "Anselmo Reyes is Professor of Legal Practice at Hong Kong University, a position he assumed in October 2012. He also practices as a commercial arbitrator. He was a judge of the High Court of Hong Kong from 2003-12. As judge, he was in charge of the Construction and Arbitration List (2004-8) and the Commercial and Admiralty Lists (2008-12). He was called to the Hong Kong Bar in 1986, becoming Senior Counsel in May 2001. He was admitted to the Singapore Bar in 1995. In April 2013, he became Representative of the Asia-Pacific Regional Office of the Hague Conference on Private International Law."
  },
  {
    "Name": "Dr. Abhishek Kathuria",
    "About": "Dr. Abhishek Kathuria is an Assistant Professor of Innovation and Information Management at the School of Business of The University of Hong Kong. His primary research and teaching interests lie at the intersection of Information Systems and Strategic Management. He has taught sessions, courses and training programs at the undergraduate, graduate and executive levels. As an academic, Abhishek has provided advice and guidance to several early stage technology and service startups on IT strategy, future scenario building, and competitive strategy. Before joining academia, Abhishek gained rich and diverse work experience in IT consulting, business process consulting, and delivery management across different industry verticals that include banking, financial services, telecom, education, retail and manufacturing. Abhishek received his Ph.D. from the Goizueta Business School at Emory University and holds a graduate degree in management from the Indian Institute of Management Indore and an undergraduate degree in information technology."
  },
  {
    "Name": "Dr. Nikhil Celly",
    "About": "Nikhil Celly is an Assistant Professor of Strategy and International Business in the Faculty of Business and Economics at the University of Hong Kong. Prior to joining HKU, Nikhil taught in universities in the US and in Canada. Dr. Celly conducts research on the international strategies of large multinationals with a focus on restructuring and downsizing. His second research area is on emerging market firm competitiveness. Nikhil teaches the core Competitive Strategy course in HKU's full time and part-time MBA and also offers elective courses on Doing Business in Emerging Asia and the Global Environment of Business. He regularly conducts executive training and workshops on Strategic Management for non-profit firms, NGOs and for-profit firms."
  },
  {
    "Name": "Pamela Fung",
    "About": "Pamela is a principal for the Morgan Stanley Alternative Investment Partners Private Equity Fund of Funds group, and leads AIP's Asian investment activities from the Hong Kong office. She has ten years of industry experience. Prior to joining the firm, Pamela was a management consultant with McKinsey & Company's corporate finance practice in Hong Kong, responsible for investment opportunity identification, deal advisory, merger management and strategy development. Previously, she was a management consultant with Monitor Group, specializing in marketing strategy for clients across Asia, and a member of the corporate finance team with Lehman Brothers in Hong Kong. Pamela has a Law degree (first class honors) from the University of Hong Kong and an M.B.A. with honors in finance and management from the Wharton School of the University of Pennsylvania."
  },
  {
    "Name": "Jeffrey Maddox",
    "About": "Jeff Maddox is a partner at Cadwalader, Wickersham & Taft, an international law firm. Jeff focuses his practice on international equity and debt transactions in the Asian markets. He represents issuers, underwriters and investors in a broad range of public and private offerings, including initial public offerings listed on the New York Stock Exchange, NASDAQ, and the stock exchanges of Hong Kong. Jeff is recognized as a leading attorney by numerous publications, and is a frequent speaker on capital markets and corporate governance. Jeff earned his J.D. from the University of Denver College of Law and his B.A. from Middlebury College. He is admitted to practice in New York and has been registered as a foreign lawyer in Hong Kong since 1994."
  },
  {
    "Name": "Penelope Van Niel",
    "About": "Penelope Van Niel is an executive and career coach in Asia who coaches business executives and MBA students on advancing their careers and strengthening their leadership abilities.  Formerly, Penny was a Managing Director and Human Resources Executive with JPMorgan in New York, Hong Kong and Tokyo.  Her Human Resources roles included Head of HR for Asia Pacific, Global Investment Banking Human Resource Executive and senior roles in Leadership and Development.  Penny has an MBA in Finance from Columbia University, a BA in History from Princeton University and a Coaching Certification from New York University."
  }
]