[
  {
    "Name": "Vikay Narainaen",
    "Role": "Co-Founder and Chairman",
    "About": "Vikay is responsible for devising our strategy and overseeing its implementation by our leadership team. He also chairs our board, ensuring effectiveness in all aspects of its role, and leads our organization in its relationships with major stakeholders. He is the Chairman and CEO of SpeechExpress, a non-profit that he co-founded to empower youth with speech. He has held various leadership roles in both for-profits and non-profits in the past, including Chief Executive of ELI Africa where he launched numerous initiatives. He has also founded HKU Campus Toastmasters Club, where he served as the first President, and TecHKU, The HKU Journal of Technology, where he serves as consultant. Vikay spent the past year on a placement at Bank of America Merrill Lynch, London and he is back at HKU to complete his final year of BEng Computer Science."
  },
  {
    "Name": "Suhail Bindra",
    "Role": "Co-Founder and Vice Chairman",
    "About": "Suhail was the previous Managing Director of the organization. He has taken on numerous leadership roles in high school, ranging from being the Vice-President of the Student Representative Council to the CEO of the Coffee House Series, a charitable non-profit arts organisation that raised thousands of dollars for educational institutions in Kenya. He has interned at Gilt Chambers, Des Voeux Chambers, Temple Chambers,  Cadwalader Wickersham & Taft LLP, and the NASDAQ OMX group. He has worked on cases of dangerous drug trafficking, international money laundering, professional negligence, winding-up proceedings and nurtured a keen interest in exploring the latest financial instruments. Suhail is studying law at HKU and he is an avid golfer and a competitive debater."
  },
  {
    "Name": "Deborah Wong",
    "Role": "Co-Founder and Co-Managing Director",
    "About": "Deborah, together with Neetesh, is the head of the leadership team and responsible for the day to day running of the organization. She is also responsible for ensuring compliance at ECG. She previously held the position of Head of Engagement and subsequently Managing Director at ECG. She has interned three times at Anthony Rogers’ Chambers, working on cases dealing with construction disputes and criminal charges. Fluent in German and with a passion to analyse historical laws, Deborah produced a research paper that analysed and compared the denazification laws in East and West Germany. She has participated in four art exhibitions and organised her first exhibition in 2012. She enjoys baking, horse riding and learning new languages. Deborah is studying law and German at HKU and she will spend the next semester on exchange in Germany."
  },
  {
    "Name": "Neetesh Pansare",
    "Role": "Co-Managing Director",
    "About": "Neetesh, together with Deborah, is the head of the leadership team and responsible for the day to day running of the organization. He is also responsible for ensuring effective strategic and operational financial planning, monitoring and reporting to enhance the decision making process of our leadership team. He was a project development intern at Happy Hearts Fund, an international social enterprise that builds schools in areas that are affected by natural disasters. He has also held various leadership positions in student councils at school. He is passionate about cricket and actively plays different sports like badminton, table tennis, squash and football. He is also fascinated by cars. He is currently studying Mechanical Engineering at HKU and aspires to be an automobile engineer."
  },
  {
    "Name": "Min Choi",
    "Role": "Head of Engagement",
    "About": "Min is in charge of handling and overseeing our consulting projects, from their pre-contractual stages to completion. Ever keen to bring a positive change to society, Min has constantly devoted her time to a wide range of volunteering works and has joined ECG for the same reason in summer 2015.  She has assumed a number of leadership roles since her high school years, including chairpersonship of the UNESCO Associated Schools Project Network in South Korea, and she most recently served on the council of Korean Student Association at HKU. She worked in a legal firm as an intern under the supervision of a Korean solicitor practising in Hong Kong. She loves travelling and has played both the piano and flute for years. Min is studying law and political science at HKU."
  },
  {
    "Name": "Eunice Sung",
    "Role": "Head of Talent Management",
    "About": "Eunice is responsible for recruitment and the development of a dynamic training programme to ensure that our consultants are well trained to serve the needs of our clients. Eunice previously worked as a consultant at ECG where she performed research and data analysis for our first yearlong client. Passionate about charity, she interned at Crossroad, a non-profit organization that helps the poor around the globe via fair trade and donations, during the recent summer break. She enjoys playing Legos and food models. Eunice is studying Social Sciences at HKU."
  },
  {
    "Name": "Clarence Hou",
    "Role": "Head of Operations",
    "About": "Clarence is charged with ensuring the efficiency and effectiveness of our daily operations. He is also responsible for directing our mentorship program and implementing new initiatives, including Speaker Series and Case Competition for the coming year. He was Vice President of debate association in high school and is currently a Green Gown Guide at HKU. He was previously a consultant at ECG, interned at a think tank based in Hong Kong and a consulting firm based in London, where he advised clients ranging from for-profit firms, multinational NGOs to organic farms. He also interned in a Chinese investment bank in Shenzhen. Beyond his concentrations in accounting and finance, Clarence has an avid interest in the humanities. He holds a Certificate in Social Sciences and Humanities from Sciences Po Paris and was a leading actor in Shakespeare Theatre Group. He is a keen Lacrosse player and practises Krav Maga."
  },
  {
    "Name": "Olivia Wong",
    "Role": "Head of Marketing",
    "About": "Olivia is responsible for carrying out effective and extensive marketing initiatives for our organization. She has previously served as Vice President of University Business Consulting Club, UBCC, one of the largest student-run consulting groups in HKU. She was an intern at CRIC, performing industrial research and report writing for the annual real estate report. Enthusiastic about dealing with clients, she interned in the commercial banking department of HSBC during the summer. Olivia likes travelling in her spare time and enjoys cooking at home. She is currently studying Economics and Finance at HKU."
  },
  {
    "Name": "Arya Demehri",
    "Role": "Marketing Writer and Editor",
    "About": "Arya is in charge of editing, writing for the ECG website, and writing the bi-monthly newsletter- in addition to various other marketing materials. He has experience teaching business English to adults in Shanghai and also worked at a law firm in the U.S., where he created a filing system and edited numerous legal briefs. Prior to this, he was a summer intern at Baltimore City Hall, where he analyzed local policy issues, drafted emails for the councilman he represented, and assisted in sensitive matters regarding the district’s constituency. In addition to being a movie buff, his interests include weight-lifting, hiking, and voraciously devouring whatever literature he can get his hands on. Arya graduated from Salisbury University in 2013, where he received his degree in Political Science."
  },
  {
    "Name": "Louisa Shi",
    "Role": "Co-Founder",
    "About": "Louisa has previously served as Head of Talent Management and subsequently Head of Finance at ECG. She was the Vice President of Finance and Compliance on the Executive Board of AIESEC HKU, the largest youth-run organization in the world, before joining our organization. In 2013, she interned at KPMG as a trainee in the financial services department, where she performed industrial research and final auditing for securities and insurance companies. Passionate about capital markets, she is interning in the Investment Banking Division of a local securities firm in Shanghai during summer 2014. Louisa is a movie buff, a bookworm and she has always been fascinated by Formula One racing. She double majors in global business and quantitative finance at HKU."
  }
]